
/**
老師當機種身分:
  * 觀察者：從外面觀察（一點點時間），我們至少每周花過 5-10 min在每個團隊上面
  * 陪伴者：不一定參與製作，但會參與討論，從團隊裡面觀察，可能稍微帶領他們
  * 夥伴：
    * 主力：好好一起參與做，跟著帶領大家
    * 工具人：參與討論，當團隊工具人

Table columns:
* Icon + Title
* Contributors
* 負責 GM + GM 目前的 role/參與度
* 健康
* Buttons / 更多項目:
  * 紀錄、輯專案...

健康的因素：
* 主力的認真度、GM 的參與度、其他人的參與度
* 所有夥伴的目前 level vs. 表現？
* 專案規模（越大就越難做出來）
* 最近分享狀況
* 目前主要讓人卡住的問題
* 外力 (例如：接案的時候，會有外面的專案主人)

* 更多會不會成功的因素。。。。


更多專案的資訊與管理方式
* 主力跟其他的參與者
* 專案類別：case study、接案、自主創作、其他更多？


紀錄方式
* CRUD a list of 紀錄 (author, content)
* markdown (add pure links to markdown)
* Concepts
  * 觀察紀錄
  * 各種『健康』的因素
  * 他們的想法 vs. 我們的想法（他們有沒有看得出來我們看得出來的問題？他們有沒有在認真面對明顯的問題？）
  * Guardian 問過的問題／要問的問題
 */